var ESs = {
	1 : {
		17 : "接到开窗指令",
		18 : "正在开窗",
		19 : "开窗到位",
		20 : "接到关窗指令",
		21 : "正在关窗",
		22 : "关窗到位",
		23 : "接到停止指令",
		24 : "中间位置",
		108 : "窗户故障",
		107 : "开窗超时",
		106 : "关窗超时"
	},
	2 : {
		33 : "接到启动指令",
		34 : "已经启动",
		35 : "接到停止指令",
		36 : "已经停止",
		105 : "风机没有启动",
		104 : "负载超载"
	},
	3 : {
		49 : "接到开启指令",
		50 : "接到开窗指令",
		51 : "接到开风机指令",
		52 : "接到关风机指令",
		53 : "接到关窗指令",
		54 : "接到关闭指令",
		55 : "正在开窗",
		56 : "开窗到位",
		57 : "风机已经启动",
		58 : "风机已经停止",
		59 : "正在关窗",
		60 : "关窗到位",
		61 : "窗户中间位置",
		108 : "窗户故障",
		107 : "开窗超时",
		106 : "关窗超时",
		104 : "负载超载",
		103 : "风机没有运行"
	},
	4 : {
		65 : "接到正向启动指令",
		66 : "正向已经启动",
		67 : "接到方向启动指令",
		68 : "反向已经启动",
		69 : "接受停止指令",
		70 : "风机已经停止",
		103 : "风机没有运行",
		104 : "负载超载",
		102 : "反向未运行"
	},
	5 : {
		1 : "开启",
		0 : "关闭"
	},
	6 : {
		1 : "开启",
		0 : "关闭"
	},
	7 : {
		1 : "开启",
		0 : "关闭"
	},
	8 : {
		33 : "接到启动指令",
		34 : "已经启动",
		35 : "接到停止指令",
		36 : "已经停止",
		37 : "正在开窗",
		38 : "正在关窗",
		39 : "窗户已经关闭",
		151 : "风机没有启动",
		152 : "负载超载"
	},
	9 : {
		33 : "接到启动指令",
		34 : "已经启动",
		35 : "接到停止指令",
		36 : "已经停止",
		37 : "正在开窗",
		38 : "正在关窗",
		39 : "窗户已经关闭",
		151 : "风机没有启动",
		152 : "负载超载"
	},
	10 : {
		1 : "开启",
		0 : "关闭"
	}
};
function getEquipStatus(type, status){
	if(type > 0 && type < 11){
		var ss = ESs[type];
		return ss[Math.abs(status)];
	}
}